# Pandas Series value counts

In [1]:
# Pandas Series is one dimensional array with axis labels. Labels need not be unique and mostly hashable type.

In [2]:
import pandas as pd

In [3]:
data = pd.read_csv("/Users/archanaqueen/Desktop/employees.csv")

In [4]:
data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [5]:
data["Gender"]

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995       NaN
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: object

In [6]:
# value_counts

It will count the frequency of the unique values in the series. So here data['Gender'] we are applying this value_counts. This will find out the distinct value within that column and count how many times they appear

In [7]:
data["Gender"].value_counts()

Female    431
Male      424
Name: Gender, dtype: int64

In [8]:
data["Gender"].value_counts(ascending=True)

Male      424
Female    431
Name: Gender, dtype: int64

In [9]:
# To know how frequent each values appear. Instead of knowing the count of each values.

In [10]:
data["Gender"].value_counts(normalize=True)

Female    0.504094
Male      0.495906
Name: Gender, dtype: float64

In [11]:
data["Gender"].value_counts(normalize=True) * 100

Female    50.409357
Male      49.590643
Name: Gender, dtype: float64

In [12]:
# So this gives that, how frequent each values appear in this whole series. 50.4% of female and 49.5% of male

In [13]:
# Now we go for continous value => Salary

In [14]:
data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [15]:
data.Salary

0       97308
1       61933
2      130590
3      138705
4      101004
        ...
995    132483
996     42392
997     96914
998     60500
999    129949
Name: Salary, Length: 1000, dtype: int64

In [16]:
# longer series of continuous value

In [17]:
data.Salary.value_counts()

121160    2
145988    2
86676     2
147183    2
91462     2
         ..
91344     1
86326     1
98753     1
113060    1
129949    1
Name: Salary, Length: 995, dtype: int64

# Bins are used only in numerical values and it splits the dataframe into 3 bins. That is total length=1000.It splits into 3 bins.

# Bins will give the range of salary based on 3 bins

In [18]:
data.Salary.value_counts(bins=3)

(34898.10400000001, 73311.333]    347
(73311.333, 111609.667]           345
(111609.667, 149908.0]            308
Name: Salary, dtype: int64

In [19]:
347 + 345 + 308

1000

In [21]:
# See the total is 1000.